{
  "header": {
    "title": "Portfolio – Radosław Nagiel"
  },
  "projects": {
    "now": "currently",
    "targeto": {
      "name": "Targeto",
      "description": "<b>Mobile App for Goal Setting and Achievement</b><br>Currently in development, not yet publicly available<br>Author project: concept, UX/UI design, implementation<br><br><b>Description:</b><br>Targeto is my original mobile application designed for individuals who want to effectively plan, achieve, and track their goals while building positive habits. It’s designed with a focus on minimalism, clarity, and daily usability. The app supports users at every stage of their goal journey – from planning and daily actions to regular summaries.<br><br><b>Key features:</b><br><br>- <b>Goal creation and management</b> – organize goals by categories (e.g., learning, work, fitness) and define your own custom areas.<br>- <b>Daily activity tracking</b> – users check off completed tasks, and the app continuously displays progress as a percentage of goal completion.<br>- <b>Notifications</b> – automatic reminders related to goals, activities, and weekly/monthly summaries.<br>- <b>Statistics and progress analysis</b> – clear and motivating data presentation (planned goals, completion percentages, daily activity).<br>- <b>Personalization</b> – choice of light or dark theme, and customizable notification settings.<br>- <b>Backup support</b> – ability to locally save and restore data backups.<br><br><b>My role:</b><br>Full responsibility for the entire app development process – from idea and design to implementation and testing."
    },
    "quiz": {
      "name": "Quiz",
      "description": "<b>Web Application – Single–Choice Quiz</b><br>Created as a recruitment task for <i>MAE Multimedia Art & Education</i><br><br><b>Description:</b><br>A single–choice quiz web application developed as part of a recruitment task. The project was implemented according to technical specifications, with a strong focus on functionality. The main goal was to deliver a complete and smooth quiz experience.<br><br><b>Key features:</b><br><br>- <b>Start screen</b> with the ability to begin the quiz and switch the language (PL/EN).<br>- <b>Quiz questions</b> with multiple single–choice answers and a button to proceed.<br>- <b>Summary screen</b> showing the number of correct and incorrect answers, along with a dynamic message based on the score (0–50%, 51–80%, 81–100%).<br>- <b>Answer review</b> after completing the quiz – displaying the user's answers and the correct ones for each question.<br>- <b>Bilingual support</b> – all content is loaded from external `.json` files, with the option to switch languages at any time without interrupting the quiz.<br>- <b>Automatic restart</b> – after 5 minutes of inactivity, the app automatically returns to the start screen.<br><br><b>My role:</b><br>Full implementation of the task – frontend development in Angular according to the technical requirements, thoughtful component structure, logic for the quiz flow, translations, automatic reset, and dynamic result display.",
      "gitHubButton": "GitHub",
      "quizButton": "Quiz demo"
    },
    "wineryV2": {
      "name": "Winery V2",
      "description": "<b>Mobile Assistant for Home Winemakers</b><br>This is a refreshed and improved version of my engineering thesis project<br>Author project: concept, UX/UI design, implementation, and publication<br><br><b>Description:</b><br>Winery is my original mobile application designed for home winemaking enthusiasts. It acts as a personal assistant throughout the entire wine production process – from planning and ingredient calculation to tracking progress and saving finished wines.<br><br><b>Key features:</b><br><br>- <b>Recipes and guides</b> – a collection of proven recipes and practical tips for both beginners and experienced winemakers.<br>- <b>Winemaking calculators</b> – essential during wine production, automatically calculating values based on measurements.<br>- <b>Step–by–step guidance</b> – the app walks users through the entire winemaking process, showing each stage and sending reminders.<br>- <b>Progress tracking</b> – mark completed steps and monitor which stage each wine is currently in.<br>- <b>Winery management</b> – save wines in production and finished bottles with editing options and personal notes.<br>- <b>Custom recipes</b> – create and save your own formulas for future use.<br>- <b>Wine photos</b> – add images to help distinguish between wines easily.<br>- <b>Personalization</b> – choose between light and dark mode to match your preferences.<br>- <b>Backup</b> – locally save and restore data backups.<br><br><b>My role:</b><br>Full responsibility for the entire process – from concept and design to implementation, testing, and publication.<br>",
      "gitHubButton": "GitHub",
      "shopButton": "Android shop"
    }
  }
}
