{
  "header": {
    "title": "Portfolio - Radosław Nagiel"
  },
  "projects": {
    "now": "currently",
    "targeto": {
      "name": "Targeto",
      "description": "Mobile app for goal setting and achievement.<br>Not yet published — development in progress.<br>Author project: concept, UX/UI design, implementation<br><br>Description:<br>Targeto is my own mobile app designed for people who want to effectively plan, achieve, and track their goals while building better habits. It’s created with a focus on minimalism, clarity, and everyday usability. The app supports the user at every stage of goal realization — from planning and daily actions to regular progress summaries.<br><br>Key features:<br><br>Create and manage goals by category (e.g. learning, work, fitness) with the ability to define custom areas.<br><br>Daily activity tracking — users mark completed tasks, and the app continuously shows progress with percentage-based goal completion.<br><br>Automatic push notifications.<br><br>Progress statistics and analytics — data presented in a simple and motivating way (planned goals, completion percentage, daily activity).<br><br>Intuitive and responsive user interface designed for quick access to key features and maximum usability.<br><br>My role:<br>Full responsibility for the entire app development process — from concept, through UI design, to implementation."
    },
    "quiz": {
      "name": "Quiz",
      "description": "Single-choice Quiz<br>Created as a recruitment task for MAE Multimedia Art & Education<br><br>Description:<br>This is a single-choice quiz web application developed as part of a recruitment assignment. The project was built according to a detailed technical specification, with a focus on simplicity, functionality, and bilingual support. The main goal was to deliver a complete and seamless quiz experience in a fixed resolution of 1920×1080px.<br><br>Key features:<br><br>- Start screen with the option to begin the quiz and switch language (PL/EN).<br>- Quiz questions with multiple answer options (single-choice) and a button to proceed to the next question.<br>- Summary screen displaying the number of correct and incorrect answers, along with a dynamic message based on the result (0–50%, 51–80%, 81–100%).<br>- Answer review after completing the quiz – shows both user-selected and correct answers for each question.<br>- Bilingual support – all content is loaded from external .json files, and the language can be changed at any time without interrupting the quiz.<br>- Automatic restart – after 5 minutes of inactivity, the app returns to the start screen.<br><br>My role:<br>Complete implementation of the task – frontend development using Angular according to technical requirements, thoughtful component structure, handling quiz logic, translations, inactivity reset, and dynamic result feedback.",
      "gitHubButton": "GitHub",
      "quizButton": "Quiz demo"
    }
  }
}
