{
  "noProjectsInfo": "Brak projektów spełniających wybrane kryteria",
  "bottomInfo": "Strona jest w budowie i jeszcze wiele projektów czeka na dodanie",
  "header": {
    "title": "Portfolio – Radosław Nagiel",
    "tooltips": {
      "filter": "Filtruj projekty",
      "theme": "Zmień motyw",
      "language": "Zmień język"
    }
  },
  "projectType": {
    "private": "Prywatny",
    "professional": "Zawodowy",
    "group": "Grupowy",
    "webApp": "Aplikacja webowa",
    "mobileApp": "Aplikacja mobilna",
    "game": "Gra"
  },
  "filters": {
    "title": "Filtry",
    "projectType": "Typ projektu",
    "language": "Język programowania",
    "framework": "Framework",
    "api": "API",
    "library": "Biblioteka",
    "utility": "Narzędzie"
  },
  "projects": {
    "now": "aktualnie",
    "technologies": "Zastosowane technologie:",
    "targeto": {
      "name": "Targeto",
      "description": "<b>Aplikacja Mobilna do wyznaczania i realizacji celów</b><br>Prace nad nią trwają, nie jest jeszcze dostępna publicznie<br>Projekt autorski: pomysł, projekt UX/UI, implementacja<br><br><b>Opis:</b><br>Targeto to moja autorska aplikacja mobilna stworzona z myślą o osobach, które chcą skutecznie planować, realizować i monitorować swoje cele oraz rozwijać dobre nawyki. Zaprojektowana z naciskiem na minimalizm, przejrzystość i codzienną użyteczność. Aplikacja wspiera użytkownika na każdym etapie realizacji celów – od planowania, przez codzienne działania, aż po regularne podsumowania.<br><br><b>Funkcje kluczowe:</b><br>- <b>Tworzenie i zarządzanie celami</b> – podział na kategorie (np. nauka, praca, sport) oraz możliwość definiowania własnych obszarów.<br>- <b>Codzienne śledzenie aktywności</b> – użytkownik odznacza wykonane zadania, a aplikacja na bieżąco prezentuje postępy w formie procentowego wypełnienia celu.<br>- <b>Powiadomienia</b> – automatyczne przypomnienia dotyczące celów, aktywności i podsumowań.<br>- <b>Statystyki i analizy postępów</b> – prezentacja danych w prosty i motywujący sposób (zaplanowane cele, procent realizacji, aktywność dzienna).<br>- <b>Personalizacja</b> – możliwość wyboru jasnego lub ciemnego motywu, oraz dostosowanie powiadomień.<br>- <b>Kopia zapasowa</b> – możliwość lokalnego zapisania, oraz wczytania kopii zapasowej danych.<br><br><b>Moja rola:</b><br>Pełna odpowiedzialność za cały proces tworzenia aplikacji – od pomysłu, przez projektowanie, implementację i testowanie."
    },
    "quiz": {
      "name": "Quiz",
      "description": "<b>Aplikacja webowa, quiz jednokrotnego wyboru</b><br>Zrealizowane jako zadanie rekrutacyjne dla firmy <i>MAE Multimedia Art & Education</i><br><br><b>Opis:</b><br>Aplikacja webowa typu quiz jednokrotnego wyboru, stworzona w ramach zadania rekrutacyjnego. Projekt został zaprojektowany zgodnie ze specyfikacją techniczną, z naciskiem na funkcjonalność. Głównym celem było stworzenie pełnego i płynnego quizu.<br><br><b>Funkcje kluczowe:</b><br>- <b>Ekran startowy</b> z możliwość rozpoczęcia quizu i zmiany języka (PL/EN).<br>- <b>Pytania quizowe</b> z kilkoma odpowiedziami jednokrotnego wyboru oraz przyciskiem przejścia dalej.<br>- <b>Ekran podsumowania</b> z liczbą poprawnych i błędnych odpowiedzi oraz dynamicznym komunikatem zależnym od wyniku (0–50%, 51–80%, 81–100%).<br>- <b>Podgląd odpowiedzi</b> po zakończeniu quizu – prezentacja udzielonych i poprawnych odpowiedzi dla każdego pytania.<br>- <b>Dwujęzyczność</b> – wszystkie treści pobierane z zewnętrznych plików .json, możliwość zmiany języka w dowolnym momencie bez przerywania quizu.<br>- <b>Automatyczny restart</b> – po 5 minutach bezczynności aplikacja automatycznie wraca do ekranu startowego.<br><br><b>Moja rola:</b><br>Pełna realizacja zadania – implementacja frontendowa w Angularze zgodnie z wymaganiami technicznymi, przemyślany podział komponentów, obsługa logiki quizu, tłumaczeń, automatycznego resetu oraz dynamicznej prezentacji wyników.",
      "gitHubButton": "GitHub",
      "quizButton": "Demo quizu"
    },
    "wineryV2": {
      "name": "Winery - wersja druga",
      "description": "<b>Mobilny asystent domowego winiarza</b><br>Jest to odświeżona i ulepszona wersja mojej pracy inżynierskiej<br>Projekt autorski: pomysł, projekt UX/UI, implementacja, publikacja<br><br><b>Opis:</b><br>Winery to moja autorska aplikacja mobilna, stworzona z myślą o pasjonatach domowego winiarstwa. Aplikacja pełni rolę osobistego asystenta w całym procesie produkcji wina – od planowania i przeliczania składników, po zapisywanie własnych win i śledzenie postępów.<br><br><b>Funkcje kluczowe:</b><br>- <b>Przepisy i poradniki</b> – baza sprawdzonych przepisów oraz praktycznych wskazówek dla początkujących i zaawansowanych.<br>- <b>Kalkulatory winiarskie</b> – niezbędne podczas wytwarzania wina, automatyczne obliczanie na podstawie pomiarów.<br>- <b>Krok po kroku</b> – aplikacja prowadzi użytkownika przez cały proces produkcji, pokazując kolejne etapy i przypominając o działaniach.<br>- <b>Śledzenie postępu</b> – możliwość zaznaczania wykonanych kroków i obserwowania, na jakim etapie produkcji znajduje się dane wino.<br>- <b>Zarządzanie winiarnią</b> – zapisywanie win w trakcie produkcji oraz gotowych butelek z możliwością edycji i dodawania notatek.<br>- <b>Własne przepisy</b> – możliwość tworzenia i zapisywania własnych receptur, które można wykorzystać w przyszłości.<br>- <b>Zdjęcia win</b> – możliwość dodania zdjęcia, aby z łatwością rozróżnić wina w przyszłości.<br>- <b>Personalizacja</b> – możliwość wyboru jasnego lub ciemnego motywu.<br>- <b>Kopia zapasowa</b> – możliwość lokalnego zapisania, oraz wczytania kopii zapasowej danych.<br><br><b>Moja rola:</b><br>Pełna odpowiedzialność za cały proces: od pomysłu i projektowania, przez implementację, po testowanie i publikację.",
      "gitHubButton": "GitHub",
      "shopButton": "Android sklep"
    },
    "safetyHab": {
      "name": "Safety Hab",
      "webPage": "Strona projektu",
      "description": "<b>Aplikacja webowa i mobilna do zarządzania firmą</b><br>Projekt zawodowy – zespół ok. 12 osób<br><br><b>Opis:</b><br>Safety Hab to rozbudowana aplikacja wspierająca zarządzanie organizacją – zarówno od strony administracyjnej, jak i pracowniczej. System dostępny jest w wersji webowej i mobilnej, a jego funkcje zostały zaprojektowane z myślą o usprawnieniu komunikacji, ewidencji czasu pracy oraz zarządzaniu strukturą firmy. Kluczowym aspektem projektu było tworzenie inteligentnych komponentów oraz ich płynna integracja między platformami.<br><br><b>Funkcje kluczowe:</b><br>- <b>Organizacja i struktura</b>– przegląd oddziałów, stanowisk, kierownictwa i pracowników.<br>- <b>Harmonogram zespołu</b>– lista pracowników i wpisy zadań (status, przypisany zespół, czas trwania, powtarzalność, opis, itd.).<br>- <b>Ewidencja czasu pracy</b>– przypisywanie godzin do zadań i projektów.<br>- <b>Karta pracownika</b>– dane kontaktowe, personalne, stanowisko, forma zatrudnienia, przypisane projekty.<br>- <b>Stanowiska pracy</b>– opis obowiązków, wymaganych kompetencji, szkoleń i czynników ryzyka.<br>- <b>Wnioski o dni wolne</b>– formularz z opisem, statusem i kalendarzem dni wolnych.<br>- <b>Moduły ról użytkowników:</b><br>&ensp;- <b>super admin</b>– zarządzanie organizacjami i kontami<br>&ensp;- <b>admin</b>– pełne zarządzanie organizacją, projektami, kalendarzem i zespołem<br>&ensp;- <b>użytkownik</b>– czas pracy, statystyki, projekty, dni wolne, ustawienia konta<br><br><b>Moja rola:</b><br>- Pełna odpowiedzialność za aplikację mobilną – implementacja i publikacja<br>- Współtworzenie aplikacji webowej – implementacja wybranych funkcjonalności<br>- Dodatkowo: sporadyczne wsparcie przy pracach nad API<br><br><i>Źródło grafik – safetyhab.com</i>"
    },
    "lureForReal": {
      "name": "Lure For Real",
      "androidButton": "Android sklep",
      "iosButton": "iOS sklep",
      "webPage": "Strona projektu",
      "description": "<b>Mobilna aplikacja randkowa z webowym panelem administracyjnym</b><br>Projekt zawodowy – zespół ok. 5 osób<br><br><b>Opis:</b><br>Lure For Real to nowoczesna aplikacja randkowa, której głównym celem jest ułatwienie spotkań w rzeczywistych lokalizacjach. Po zalogowaniu i utworzeniu profilu użytkownik może wybrać klub lub miejsce w swojej okolicy (na podstawie GPS) i do niego dołączyć. W danej lokalizacji widoczni są inni użytkownicy pasujący do jego preferencji. Można przeglądać ich profile i zaznaczać chęć spotkania za pomocą gestu przesunięcia (swipe). Gdy dwie osoby wyrażą zainteresowanie, uruchamiany jest między nimi czat. Jeśli dojdzie do spotkania użytkownicy mogą potwierdzić je za pomocą wyboru symbolu w aplikacji. Aplikacja korzysta z systemu powiadomień informujących o najważniejszych aktywnościach.<br><br>Całość systemu zarządzana jest z poziomu rozbudowanego panelu administracyjnego, który pozwala m.in. na pełną personalizację wyglądu aplikacji w konkretnych lokalizacjach.<br><br><b>Funkcje kluczowe – aplikacja mobilna:</b><br>- Logowanie przez Google, Apple ID lub e-mail<br>- Tworzenie i edycja profilu użytkownika (dane, zdjęcia, preferencje)<br>- Przeglądanie dostępnych lokalizacji w okolicy (na podstawie GPS)<br>- Dołączanie do lokalizacji i wyświetlanie obecnych tam użytkowników<br>- System dopasowań oparty o gesty swipe (akceptacja/odrzucenie)<br>- Czat między sparowanymi użytkownikami<br>- Funkcje premium, np. wysyłanie \"Super Drinka\" – jednej wiadomości do wielu osób<br>- Obsługa subskrypcji i płatności (różne warianty czasowe)<br><br><b>Funkcje panelu administracyjnego (web), które implementowałem:</b><br>- Tworzenie ról i kont administracyjnych przez superadmina<br>- Personalizacja motywu graficznego aplikacji w wybranych klubach (kolory, ikony)<br>- Tworzenie kampanii automatycznie przypisujących stałych użytkowników do klubów, w określonym czasie<br>- Projektowanie treści e-maili do logowania<br>- Zarządzanie lokalizacjami widocznymi w aplikacji i synchronizacja z OpenStreetMap różnych typów miejsc<br><br><b>Funkcje API, które rozwijałem:</b><br>- Obsługa ról administracyjnych<br>- System personalizacji motywów aplikacji<br><br><b>Moja rola:</b><br>- Pełna odpowiedzialność za aplikację mobilną – implementacja i publikacja<br>- Współtworzenie panelu webowego – implementacja wybranych funkcjonalności<br>- Dodatkowo: wsparcie przy wybranych elementach backendu (API)<br><br><i>Źródło grafik – lure4real.com</i>"
    },
    "warlockIdle": {
      "name": "Warlock Idle",
      "androidButton": "Android sklep",
      "description": "<b>Gra mobilna typu idle</b><br>Projekt zawodowy – zespół ok. 3 osób<br><br><b>Opis:</b><br>Warlock Idle to rozbudowana gra mobilna typu clicker idle, w której gracz wciela się w maga zdobywając moc poprzez klikanie i pasywne gromadzenie energii w magicznej kuli. Wraz z postępem można ulepszać swoje cechy poprzez losowe karty, wysyłać demony po składniki, tworzyć mikstury alchemiczne, zdobywać nowe umiejętności i dokonywać \"transferu duszy\" – restartu rozgrywki z dodatkowymi mnożnikami.<br><br><b>Funkcje kluczowe:</b><br>- System klas postaci i rozwijania umiejętności (Kolegium)<br>- Laboratorium alchemiczne do tworzenia tymczasowych ulepszeń<br>- System demonów zbierających punkty lub składniki podczas nieobecności gracza<br>- Waluta premium dostępna za reklamy lub mikrotransakcje<br>- Backendowe API chroniące grę przed oszustwami i weryfikujące poprawność stanu gry<br>- Osiągnięcia, Tablice wyników oraz system zapraszania znajomych przez linki referencyjne (z nagrodą)<br>- Paralaksa reagująca na żyroskop urządzenia<br>- Powiadomienia push<br>- Pełna oprawa dźwiękowa z możliwością konfiguracji głośności<br>- Konfigurowalne powiadomienia, język i notacja liczb<br><br><b>Moja rola:</b><br>- Zarządzanie całym projektem<br>- Pełna odpowiedzialność za aplikację mobilną (implementacja i publikacja)<br>- Pełna odpowiedzialność za backend (API oraz jego zabezpieczenia)<br>- Implementacja przygotowanych grafik i dopracowanie UX/UI"
    },
    "zdrowiej": {
      "name": "Zdrowiej",
      "androidButton": "Android sklep",
      "iosButton": "iOS sklep",
      "webPage": "Strona projektu",
      "description": "<b>Aplikacja mobilna dla osób z cukrzycą</b><br>Projekt zawodowy – zespół ok. 5 osób<br><br><b>Opis:</b><br>Zdrowiej to rozbudowana aplikacja wspierająca osoby chorujące na cukrzycę w codziennym monitorowaniu stanu zdrowia. Umożliwia m.in. automatyczne pobieranie pomiarów z urządzeń medycznych, prowadzenie dzienniczka wyników oraz udział w programach edukacyjnych. Współpracuje z dedykowanymi glukometrami, wagami i urządzeniami Bluetooth do penów insulinowych.<br><br><b>Zakres moich prac:</b><br>Projekt przejąłem po innym programiście. Moim zadaniem było zarówno usuwanie błędów, jak i rozwój aplikacji o nowe funkcjonalności:<br>- Wprowadzenie kodu edukatora – możliwość przypisania użytkownika do programu edukacyjnego podczas rejestracji.<br>- Automatyczne pobieranie pomiarów – aplikacja automatycznie wykrywa i łączy się z aktywnym urządzeniem Bluetooth z poziomu ekranu głównego.<br>- Obsługa nakładki Bluetooth do penów insulinowych: Mallya Solostar oraz Mallya Kwikpen<br>- Integracja z nowymi urządzeniami:<br>&ensp;- glukometr Glucomaxx BT<br>&ensp;- waga iXellence SCALE PRO IT<br>- Dodanie funkcji unieważniania błędnych pomiarów.<br>- Możliwość edycji liczby pasków testowych przypisanych do glukometru.<br>- Dostosowanie aplikacji do współpracy z nową architekturą mikroserwisów.<br><br><b>Moja rola:</b><br>- Rozwój i utrzymanie aplikacji mobilnej<br>- Implementacja nowych funkcji i integracji sprzętowych<br>- Naprawa błędów <br>- Współpraca z zespołem backendowym<br><br><i>Źródło grafik: play.google.com/store/apps/details?id=com.genexo.zdrowiej</i>"
    },
    "winery": {
      "name": "Winery",
      "description": "<b>Aplikacja mobilna do pomocy przy wytwarzaniu wina</b><br>Jest to aplikacja stworzona w ramach mojej pracy inżynierskiej<br>Projekt autorski: pomysł, projekt UX/UI, implementacja<br><br><b>Opis:</b><br>Winery to moja autorska aplikacja mobilna, stworzona z myślą o pasjonatach domowego winiarstwa. Aplikacja pełni rolę osobistego asystenta w całym procesie produkcji wina – od planowania i przeliczania składników, po zapisywanie własnych win i śledzenie postępów.<br><br><b>Funkcje kluczowe:</b><br>- <b>Przepisy i poradniki</b> – baza sprawdzonych przepisów oraz praktycznych wskazówek dla początkujących i zaawansowanych.<br>- <b>Kalkulatory winiarskie</b> – niezbędne podczas wytwarzania wina, automatyczne obliczanie na podstawie pomiarów.<br>- <b>Krok po kroku</b> – aplikacja prowadzi użytkownika przez cały proces produkcji, pokazując kolejne etapy i przypominając o działaniach.<br>- <b>Śledzenie postępu</b> – możliwość zaznaczania wykonanych kroków i obserwowania, na jakim etapie produkcji znajduje się dane wino.<br>- <b>Zarządzanie winiarnią</b> – zapisywanie win w trakcie produkcji oraz gotowych butelek z możliwością edycji.<br>- <b>Własne przepisy</b> – możliwość tworzenia i zapisywania własnych receptur, które można wykorzystać w przyszłości.<br><br><b>Moja rola:</b><br>Pełna odpowiedzialność za cały proces: od pomysłu i projektowania, przez implementację, po testowanie i publikację.",
      "gitHubButton": "GitHub"
    }
  }
}
