{
  "noProjectsInfo": "Brak projektów spełniających wybrane kryteria",
  "bottomInfo": "Strona jest w budowie i jeszcze wiele projektów czeka na dodanie",
  "header": {
    "title": "Portfolio – Radosław Nagiel",
    "tooltips": {
      "filter": "Filtruj projekty",
      "theme": "Zmień motyw",
      "language": "Zmień język"
    }
  },
  "projectType": {
    "private": "Prywatny",
    "professional": "Zawodowy",
    "group": "Grupowy",
    "individual": "Indywidualny",
    "webApp": "Aplikacja webowa",
    "mobileApp": "Aplikacja mobilna",
    "game": "Gra"
  },
  "filters": {
    "title": "Filtry",
    "projectType": "Typ projektu",
    "language": "Język programowania",
    "framework": "Framework",
    "api": "API",
    "library": "Biblioteka",
    "utility": "Narzędzie",
    "clearAllTooltip": "Wyczyść wszystkie filtry",
    "clearTooltip": "Wyczyść filtr"
  },
  "projects": {
    "now": "aktualnie",
    "technologies": "Zastosowane technologie:",
    "targeto": {
      "name": "Targeto",
      "description": "<b>Aplikacja Mobilna do wyznaczania i realizacji celów</b><br>Prace nad nią trwają, nie jest jeszcze dostępna publicznie<br>Projekt autorski: pomysł, projekt UX/UI, implementacja<br><br><b>Opis:</b><br>Targeto to moja autorska aplikacja mobilna stworzona z myślą o osobach, które chcą skutecznie planować, realizować i monitorować swoje cele oraz rozwijać dobre nawyki. Zaprojektowana z naciskiem na minimalizm, przejrzystość i codzienną użyteczność. Aplikacja wspiera użytkownika na każdym etapie realizacji celów – od planowania, przez codzienne działania, aż po regularne podsumowania.<br><br><b>Funkcje kluczowe:</b><br>- <b>Tworzenie i zarządzanie celami</b> – podział na kategorie (np. nauka, praca, sport) oraz możliwość definiowania własnych obszarów.<br>- <b>Codzienne śledzenie aktywności</b> – użytkownik odznacza wykonane zadania, a aplikacja na bieżąco prezentuje postępy w formie procentowego wypełnienia celu.<br>- <b>Powiadomienia</b> – automatyczne przypomnienia dotyczące celów, aktywności i podsumowań.<br>- <b>Statystyki i analizy postępów</b> – prezentacja danych w prosty i motywujący sposób (zaplanowane cele, procent realizacji, aktywność dzienna).<br>- <b>Personalizacja</b> – możliwość wyboru jasnego lub ciemnego motywu, oraz dostosowanie powiadomień.<br>- <b>Kopia zapasowa</b> – możliwość lokalnego zapisania, oraz wczytania kopii zapasowej danych.<br><br><b>Moja rola:</b><br>Pełna odpowiedzialność za cały proces tworzenia aplikacji – od pomysłu, przez projektowanie, implementację i testowanie."
    },
    "quiz": {
      "name": "Quiz",
      "description": "<b>Aplikacja webowa, quiz jednokrotnego wyboru</b><br>Zrealizowane jako zadanie rekrutacyjne dla firmy <i>MAE Multimedia Art & Education</i><br><br><b>Opis:</b><br>Aplikacja webowa typu quiz jednokrotnego wyboru, stworzona w ramach zadania rekrutacyjnego. Projekt został zaprojektowany zgodnie ze specyfikacją techniczną, z naciskiem na funkcjonalność. Głównym celem było stworzenie pełnego i płynnego quizu.<br><br><b>Funkcje kluczowe:</b><br>- <b>Ekran startowy</b> z możliwość rozpoczęcia quizu i zmiany języka (PL/EN).<br>- <b>Pytania quizowe</b> z kilkoma odpowiedziami jednokrotnego wyboru oraz przyciskiem przejścia dalej.<br>- <b>Ekran podsumowania</b> z liczbą poprawnych i błędnych odpowiedzi oraz dynamicznym komunikatem zależnym od wyniku (0–50%, 51–80%, 81–100%).<br>- <b>Podgląd odpowiedzi</b> po zakończeniu quizu – prezentacja udzielonych i poprawnych odpowiedzi dla każdego pytania.<br>- <b>Dwujęzyczność</b> – wszystkie treści pobierane z zewnętrznych plików .json, możliwość zmiany języka w dowolnym momencie bez przerywania quizu.<br>- <b>Automatyczny restart</b> – po 5 minutach bezczynności aplikacja automatycznie wraca do ekranu startowego.<br><br><b>Moja rola:</b><br>Pełna realizacja zadania – implementacja frontendowa w Angularze zgodnie z wymaganiami technicznymi, przemyślany podział komponentów, obsługa logiki quizu, tłumaczeń, automatycznego resetu oraz dynamicznej prezentacji wyników.",
      "gitHubButton": "GitHub",
      "quizButton": "Demo quizu"
    },
    "wineryV2": {
      "name": "Winery - wersja druga",
      "description": "<b>Mobilny asystent domowego winiarza</b><br>Jest to odświeżona i ulepszona wersja mojej pracy inżynierskiej<br>Projekt autorski: pomysł, projekt UX/UI, implementacja, publikacja<br><br><b>Opis:</b><br>Winery to moja autorska aplikacja mobilna, stworzona z myślą o pasjonatach domowego winiarstwa. Aplikacja pełni rolę osobistego asystenta w całym procesie produkcji wina – od planowania i przeliczania składników, po zapisywanie własnych win i śledzenie postępów.<br><br><b>Funkcje kluczowe:</b><br>- <b>Przepisy i poradniki</b> – baza sprawdzonych przepisów oraz praktycznych wskazówek dla początkujących i zaawansowanych.<br>- <b>Kalkulatory winiarskie</b> – niezbędne podczas wytwarzania wina, automatyczne obliczanie na podstawie pomiarów.<br>- <b>Krok po kroku</b> – aplikacja prowadzi użytkownika przez cały proces produkcji, pokazując kolejne etapy i przypominając o działaniach.<br>- <b>Śledzenie postępu</b> – możliwość zaznaczania wykonanych kroków i obserwowania, na jakim etapie produkcji znajduje się dane wino.<br>- <b>Zarządzanie winiarnią</b> – zapisywanie win w trakcie produkcji oraz gotowych butelek z możliwością edycji i dodawania notatek.<br>- <b>Własne przepisy</b> – możliwość tworzenia i zapisywania własnych receptur, które można wykorzystać w przyszłości.<br>- <b>Zdjęcia win</b> – możliwość dodania zdjęcia, aby z łatwością rozróżnić wina w przyszłości.<br>- <b>Personalizacja</b> – możliwość wyboru jasnego lub ciemnego motywu.<br>- <b>Kopia zapasowa</b> – możliwość lokalnego zapisania, oraz wczytania kopii zapasowej danych.<br><br><b>Moja rola:</b><br>Pełna odpowiedzialność za cały proces: od pomysłu i projektowania, przez implementację, po testowanie i publikację.",
      "gitHubButton": "GitHub",
      "shopButton": "Android sklep"
    },
    "safetyHab": {
      "name": "Safety Hab",
      "webPage": "Strona projektu",
      "description": "<b>Aplikacja webowa i mobilna do zarządzania firmą</b><br>Projekt zawodowy – zespół ok. 12 osób<br><br><b>Opis:</b><br>Safety Hab to rozbudowana aplikacja wspierająca zarządzanie organizacją – zarówno od strony administracyjnej, jak i pracowniczej. System dostępny jest w wersji webowej i mobilnej, a jego funkcje zostały zaprojektowane z myślą o usprawnieniu komunikacji, ewidencji czasu pracy oraz zarządzaniu strukturą firmy. Kluczowym aspektem projektu było tworzenie inteligentnych komponentów oraz ich płynna integracja między platformami.<br><br><b>Funkcje kluczowe:</b><br>- <b>Organizacja i struktura</b>– przegląd oddziałów, stanowisk, kierownictwa i pracowników.<br>- <b>Harmonogram zespołu</b>– lista pracowników i wpisy zadań (status, przypisany zespół, czas trwania, powtarzalność, opis, itd.).<br>- <b>Ewidencja czasu pracy</b>– przypisywanie godzin do zadań i projektów.<br>- <b>Karta pracownika</b>– dane kontaktowe, personalne, stanowisko, forma zatrudnienia, przypisane projekty.<br>- <b>Stanowiska pracy</b>– opis obowiązków, wymaganych kompetencji, szkoleń i czynników ryzyka.<br>- <b>Wnioski o dni wolne</b>– formularz z opisem, statusem i kalendarzem dni wolnych.<br>- <b>Moduły ról użytkowników:</b><br>&ensp;- <b>super admin</b>– zarządzanie organizacjami i kontami<br>&ensp;- <b>admin</b>– pełne zarządzanie organizacją, projektami, kalendarzem i zespołem<br>&ensp;- <b>użytkownik</b>– czas pracy, statystyki, projekty, dni wolne, ustawienia konta<br><br><b>Moja rola:</b><br>- Pełna odpowiedzialność za aplikację mobilną – implementacja i publikacja<br>- Współtworzenie aplikacji webowej – implementacja wybranych funkcjonalności<br>- Dodatkowo: sporadyczne wsparcie przy pracach nad API<br><br>Źródło grafik: <i>safetyhab.com</i>"
    },
    "lureForReal": {
      "name": "Lure For Real",
      "androidButton": "Android sklep",
      "iosButton": "iOS sklep",
      "webPage": "Strona projektu",
      "description": "<b>Mobilna aplikacja randkowa z webowym panelem administracyjnym</b><br>Projekt zawodowy – zespół ok. 5 osób<br><br><b>Opis:</b><br>Lure For Real to nowoczesna aplikacja randkowa, której głównym celem jest ułatwienie spotkań w rzeczywistych lokalizacjach. Po zalogowaniu i utworzeniu profilu użytkownik może wybrać klub lub miejsce w swojej okolicy (na podstawie GPS) i do niego dołączyć. W danej lokalizacji widoczni są inni użytkownicy pasujący do jego preferencji. Można przeglądać ich profile i zaznaczać chęć spotkania za pomocą gestu przesunięcia (swipe). Gdy dwie osoby wyrażą zainteresowanie, uruchamiany jest między nimi czat. Jeśli dojdzie do spotkania użytkownicy mogą potwierdzić je za pomocą wyboru symbolu w aplikacji. Aplikacja korzysta z systemu powiadomień informujących o najważniejszych aktywnościach.<br><br>Całość systemu zarządzana jest z poziomu rozbudowanego panelu administracyjnego, który pozwala m.in. na pełną personalizację wyglądu aplikacji w konkretnych lokalizacjach.<br><br><b>Funkcje kluczowe – aplikacja mobilna:</b><br>- Logowanie przez Google, Apple ID lub e-mail<br>- Tworzenie i edycja profilu użytkownika (dane, zdjęcia, preferencje)<br>- Przeglądanie dostępnych lokalizacji w okolicy (na podstawie GPS)<br>- Dołączanie do lokalizacji i wyświetlanie obecnych tam użytkowników<br>- System dopasowań oparty o gesty swipe (akceptacja/odrzucenie)<br>- Czat między sparowanymi użytkownikami<br>- Funkcje premium, np. wysyłanie \"Super Drinka\" – jednej wiadomości do wielu osób<br>- Obsługa subskrypcji i płatności (różne warianty czasowe)<br><br><b>Funkcje panelu administracyjnego (web), które implementowałem:</b><br>- Tworzenie ról i kont administracyjnych przez superadmina<br>- Personalizacja motywu graficznego aplikacji w wybranych klubach (kolory, ikony)<br>- Tworzenie kampanii automatycznie przypisujących stałych użytkowników do klubów, w określonym czasie<br>- Projektowanie treści e-maili do logowania<br>- Zarządzanie lokalizacjami widocznymi w aplikacji i synchronizacja z OpenStreetMap różnych typów miejsc<br><br><b>Funkcje API, które rozwijałem:</b><br>- Obsługa ról administracyjnych<br>- System personalizacji motywów aplikacji<br><br><b>Moja rola:</b><br>- Pełna odpowiedzialność za aplikację mobilną – implementacja i publikacja<br>- Współtworzenie panelu webowego – implementacja wybranych funkcjonalności<br>- Dodatkowo: wsparcie przy wybranych elementach backendu (API)<br><br>Źródło grafik: <i>lure4real.com</i>"
    },
    "warlockIdle": {
      "name": "Warlock Idle",
      "androidButton": "Android sklep",
      "description": "<b>Gra mobilna typu idle</b><br>Projekt zawodowy – zespół ok. 3 osób<br><br><b>Opis:</b><br>Warlock Idle to rozbudowana gra mobilna typu clicker idle, w której gracz wciela się w maga zdobywając moc poprzez klikanie i pasywne gromadzenie energii w magicznej kuli. Wraz z postępem można ulepszać swoje cechy poprzez losowe karty, wysyłać demony po składniki, tworzyć mikstury alchemiczne, zdobywać nowe umiejętności i dokonywać \"transferu duszy\" – restartu rozgrywki z dodatkowymi mnożnikami.<br><br><b>Funkcje kluczowe:</b><br>- System klas postaci i rozwijania umiejętności (Kolegium)<br>- Laboratorium alchemiczne do tworzenia tymczasowych ulepszeń<br>- System demonów zbierających punkty lub składniki podczas nieobecności gracza<br>- Waluta premium dostępna za reklamy lub mikrotransakcje<br>- Backendowe API chroniące grę przed oszustwami i weryfikujące poprawność stanu gry<br>- Osiągnięcia, Tablice wyników oraz system zapraszania znajomych przez linki referencyjne (z nagrodą)<br>- Paralaksa reagująca na żyroskop urządzenia<br>- Powiadomienia push<br>- Pełna oprawa dźwiękowa z możliwością konfiguracji głośności<br>- Konfigurowalne powiadomienia, język i notacja liczb<br><br><b>Moja rola:</b><br>- Zarządzanie całym projektem<br>- Pełna odpowiedzialność za aplikację mobilną (implementacja i publikacja)<br>- Pełna odpowiedzialność za backend (API oraz jego zabezpieczenia)<br>- Implementacja przygotowanych grafik i dopracowanie UX/UI"
    },
    "rh": {
      "name": "Rehabilitacja Kardiologiczna",
      "description": "<b>Mobilna aplikacja wspierająca rehabilitację kardiologiczną</b><br>Projekt zawodowy – zespół ok. 5 osób<br><br><b>Opis:</b><br>Rehabilitacja Kardiologiczna to zaawansowana aplikacja mobilna wspomagająca powrót do zdrowia pacjentów po przebytych chorobach serca. Umożliwia planowanie treningów, automatyczne zbieranie pomiarów z urządzeń medycznych (holter EKG, ciśnieniomierz, waga) oraz ich podgląd w czasie rzeczywistym przez lekarzy. Aplikacja dostarcza również instrukcje, pozwala na wypełnianie ankiet oraz monitoruje wyniki względem wartości alarmowych.<br><br>Projekt przejąłem po innym programiście i odpowiadałem za modernizację oraz rozwój aplikacji.<br><br><b>Funkcje kluczowe:</b><br>- Dostęp do spersonalizowanych planów treningowych zatwierdzanych przez lekarzy<br>- Integracja z urządzeniami medycznymi (EKG, ciśnieniomierz, waga) przez Bluetooth<br>- Automatyczne pobieranie i przesyłanie pomiarów do aplikacji i backendu<br>- Możliwość monitorowania wykresu EKG przez lekarza w czasie rzeczywistym podczas treningu<br>- Wypełnianie ankiet zdrowotnych i końcowych przez użytkownika<br>- Monitoring wyników względem progów alarmowych<br>- Intuicyjne instrukcje wykonywania pomiarów<br>- Zaprojektowana z myślą o łatwej obsłudze dla osób starszych<br><br><b>Moja rola:</b><br>- Odświeżenie wyglądu aplikacji i aktualizacja bibliotek<br>- Dodanie nowych funkcji, takich jak ankieta końcowa i automatyczne zczytywanie pomiarów z ekranu głównego<br>- Poprawa błędów oraz dostosowanie aplikacji do nowej architektury mikroserwisowej<br>- Ścisła współpraca z zespołem backendowym przy integracji API<br><br>Źródło grafik: <i>chrome-stats.com/d/pl.mediguard.hybrid_rehabilitation</i>"
    },
    "zdrowiej": {
      "name": "Zdrowiej",
      "androidButton": "Android sklep",
      "iosButton": "iOS sklep",
      "webPage": "Strona projektu",
      "description": "<b>Aplikacja mobilna dla osób z cukrzycą</b><br>Projekt zawodowy – zespół ok. 5 osób<br><br><b>Opis:</b><br>Zdrowiej to rozbudowana aplikacja wspierająca osoby chorujące na cukrzycę w codziennym monitorowaniu stanu zdrowia. Umożliwia m.in. automatyczne pobieranie pomiarów z urządzeń medycznych, prowadzenie dzienniczka wyników oraz udział w programach edukacyjnych. Współpracuje z dedykowanymi glukometrami, wagami i urządzeniami Bluetooth do penów insulinowych.<br><br><b>Zakres moich prac:</b><br>Projekt przejąłem po innym programiście. Moim zadaniem było zarówno usuwanie błędów, jak i rozwój aplikacji o nowe funkcjonalności:<br>- Wprowadzenie kodu edukatora – możliwość przypisania użytkownika do programu edukacyjnego podczas rejestracji.<br>- Automatyczne pobieranie pomiarów – aplikacja automatycznie wykrywa i łączy się z aktywnym urządzeniem Bluetooth z poziomu ekranu głównego.<br>- Obsługa nakładki Bluetooth do penów insulinowych: Mallya Solostar oraz Mallya Kwikpen<br>- Integracja z nowymi urządzeniami:<br>&ensp;- glukometr Glucomaxx BT<br>&ensp;- waga iXellence SCALE PRO IT<br>- Dodanie funkcji unieważniania błędnych pomiarów.<br>- Możliwość edycji liczby pasków testowych przypisanych do glukometru.<br>- Dostosowanie aplikacji do współpracy z nową architekturą mikroserwisów.<br><br><b>Moja rola:</b><br>- Rozwój i utrzymanie aplikacji mobilnej<br>- Implementacja nowych funkcji i integracji sprzętowych<br>- Naprawa błędów <br>- Współpraca z zespołem backendowym<br><br>Źródło grafik: <i>play.google.com/store/apps/details?id=com.genexo.zdrowiej</i>"
    },
    "dkar": {
      "name": "Diagnostyka Kardiologiczna",
      "description": "<b>Mobilna aplikacja do pobierania pomiarów z urządzeń medycznych</b><br>Projekt zawodowy – zespół ok. 5 osób<br><br><b>Opis:</b><br>Diagnostyka Kardiologiczna to intuicyjna aplikacja mobilna wspierająca osoby z problemami kardiologicznymi oraz znajdujące się w grupie ryzyka. Umożliwia łatwe i automatyczne monitorowanie ciśnienia krwi oraz masy ciała dzięki integracji z dedykowanymi urządzeniami Bluetooth – ciśnieniomierzem i wagą. Wyniki są natychmiast przesyłane do aplikacji, a następnie do systemu backendowego, gdzie mogą być nadzorowane przez lekarza.<br><br>Aplikacja została zaprojektowana z myślą o osobach starszych i mniej zaawansowanych technologicznie. Obsługa została maksymalnie uproszczona – logowanie możliwe jest zarówno przez e-mail, jak i poprzez zeskanowanie kodu QR. Pomiarom towarzyszą instrukcje ułatwiające ich prawidłowe wykonanie.<br><br><b>Funkcje kluczowe:</b><br>- Logowanie przez e-mail lub skanowanie kodu QR<br>- Możliwość podpinania i odpinania urządzeń Bluetooth do konta użytkownika<br>- Automatyczne nasłuchiwanie pomiarów z wagi i ciśnieniomierza<br>- Prezentacja wyników w aplikacji w czasie rzeczywistym<br>- Wysyłanie danych do API<br>- Możliwość unieważniania błędnych pomiarów<br>- Monitoring wyników w odniesieniu do wartości alarmowych<br>- Wsparcie lekarzy w zdalnym nadzorze nad pacjentami<br><br><b>Moja rola:</b><br>- Pełna odpowiedzialność za aplikację mobilną – od implementacji po publikację<br>- Ścisła współpraca z zespołem backendowym w zakresie integracji API<br><br>Źródło grafik: <i>apkpure.com/diagnostyka-kardiologiczna/pl.mediguard.core</i>"
    },
    "winery": {
      "name": "Winery",
      "description": "<b>Aplikacja mobilna do pomocy przy wytwarzaniu wina</b><br>Jest to aplikacja stworzona w ramach mojej pracy inżynierskiej<br>Projekt autorski: pomysł, projekt UX/UI, implementacja<br><br><b>Opis:</b><br>Winery to moja autorska aplikacja mobilna, stworzona z myślą o pasjonatach domowego winiarstwa. Aplikacja pełni rolę osobistego asystenta w całym procesie produkcji wina – od planowania i przeliczania składników, po zapisywanie własnych win i śledzenie postępów.<br><br><b>Funkcje kluczowe:</b><br>- <b>Przepisy i poradniki</b> – baza sprawdzonych przepisów oraz praktycznych wskazówek dla początkujących i zaawansowanych.<br>- <b>Kalkulatory winiarskie</b> – niezbędne podczas wytwarzania wina, automatyczne obliczanie na podstawie pomiarów.<br>- <b>Krok po kroku</b> – aplikacja prowadzi użytkownika przez cały proces produkcji, pokazując kolejne etapy i przypominając o działaniach.<br>- <b>Śledzenie postępu</b> – możliwość zaznaczania wykonanych kroków i obserwowania, na jakim etapie produkcji znajduje się dane wino.<br>- <b>Zarządzanie winiarnią</b> – zapisywanie win w trakcie produkcji oraz gotowych butelek z możliwością edycji.<br>- <b>Własne przepisy</b> – możliwość tworzenia i zapisywania własnych receptur, które można wykorzystać w przyszłości.<br><br><b>Moja rola:</b><br>Pełna odpowiedzialność za cały proces: od pomysłu i projektowania, przez implementację, po testowanie i publikację.",
      "gitHubButton": "GitHub"
    },
    "akameis": {
      "name": "Akameis",
      "gameJamButton": "Strona Game Jamu",
      "gameButton": "Gra",
      "description": "<b>Gra platformowa stworzona w ramach game jamu Ludum Dare 49</b><br>Projekt prywatny – zespół 5 osób<br><br><b>Opis:</b><br>Akameis to turowa gra platformowa, w której gracz przemierza kolejne piętra tajemniczej wieży, pokonując przeciwników i wykorzystując różne umiejętności, aby dotrzeć na szczyt. Rozgrywka łączy elementy eksploracji, walki oraz budowania, a jej unikalnym wyróżnikiem jest mechanika wymuszonych tur – każdy ruch należy wykonać w ograniczonym czasie. Styl graficzny oparty na wektorowych ilustracjach nadaje grze charakterystyczny, minimalistyczny wygląd.<br><br><b>Funkcje kluczowe:</b><br>- Przechodzenie kolejnych poziomów reprezentujących piętra wieży<br>- Niszczenie obiektów za pomocą młota<br>- Stawianie bomb niszczących wszystko w zasięgu<br>- Strzelanie do przeciwników z łuku<br>- Budowanie drewnianych platform<br>- Trzy typy przeciwników o różnych zachowaniach<br>- System tur z ograniczonym czasem na wykonanie ruchu<br><br><b>Moja rola:</b><br>- Programowanie i implementacja kluczowych mechanik rozgrywki<br>- Wdrażanie logiki obsługującej interakcję gracza z obiektami i przeciwnikami<br>- Tworzenie elementów odpowiadających za niszczenie, budowanie i atakowanie wrogów"
    },
    "organizer": {
      "name": "Organizer",
      "description": "<b> Aplikacja webowa wspierająca studentów w nauce</b><br>Projekt studencki – zespół 9 osób<br><br><b> Opis:</b><br>Aplikacja webowa zaprojektowana z myślą o wsparciu studentów w organizacji nauki i codziennych obowiązków. Oferuje zestaw narzędzi ułatwiających planowanie czasu, zarządzanie zadaniami, kontrolę wydatków oraz wyszukiwanie miejsc wydarzeń na mapie. Centralnym elementem aplikacji jest asystent głosowy, który reaguje na polecenia głosowe użytkownika i odpowiada zmodulowanym głosem, umożliwiając intuicyjną i interaktywną obsługę.<br><br><b> Funkcje kluczowe:</b><br>- <b> Asystent głosowy</b> – obsługa poleceń głosowych, tworzenie wydarzeń, zadań, wydatków, informowanie o dacie i godzinie, dodatkowe komendy (np. kostka, dni do weekendu, odliczanie do końca roku).<br>- <b> Kalendarz</b> – dodawanie wydarzeń z nazwą, datą, godziną i miejscem, zintegrowany z mapą Google.<br>- <b> Bilans wydatków</b> – dodawanie, edycja i usuwanie wydatków, wykres kołowy prezentujący strukturę wydatków.<br>- <b> Lista zadań (TO-DO)</b> – dodawanie, edycja i usuwanie zadań z datą realizacji, możliwość oznaczania jako ukończone.<br>- <b> Mapa Google</b> – prezentacja lokalizacji wydarzeń w kalendarzu.<br><br><b> Moja rola:</b><br>- Implementacja obsługi asystenta głosowego – przechwytywanie komend, obsługa wszystkich dostępnych poleceń oraz integracja ich z odpowiednimi modułami aplikacji."
    },
    "simulation": {
      "name": "Symulacja skrzyżowania",
      "description": "<b>Symulacja ruchu drogowego na skrzyżowaniach</b><br>Projekt prywatny<br><br><b>Opis:</b><br>Symulacja ruchu drogowego stworzona w Unity jako projekt akademicki w ramach przedmiotu <i>Symulacja</i>. Obejmuje trzy typy skrzyżowań: kolizyjne ze światłami, bezkolizyjne ze światłami oraz rondo turbinowe. Użytkownik może uruchamiać i pauzować symulację, sterować kamerą (trzy widoki dla każdego skrzyżowania), a także regulować prędkość upływu czasu w skali od 1× do 10×.<br><br>Symulacja prezentuje aktualną oraz średnią przepustowość pojazdów (w samochodach na minutę). Pojazdy reagują na sygnalizację świetlną, poruszają się zgodnie z wyznaczonymi trasami (jazda prosto, w lewo, w prawo) i uwzględniają pojazdy znajdujące się na kursie kolizyjnym, co pozwala odzwierciedlić realistyczne zachowania w ruchu drogowym.<br><br><b>Funkcje kluczowe:</b><br>- Trzy rodzaje skrzyżowań: kolizyjne, bezkolizyjne, rondo turbinowe<br>- Uruchamianie i zatrzymywanie symulacji<br>- Trzy widoki kamery dla każdego skrzyżowania<br>- Regulacja prędkości czasu (1×–10×)<br>- Pomiar i prezentacja przepustowości ruchu w czasie rzeczywistym<br>- Realistyczne zachowania pojazdów w reakcji na światła i ruch innych aut<br><br><b>Moja rola:</b><br>- Pełna realizacja projektu – od koncepcji po implementację",
      "gitHubButton": "GitHub"
    },
    "printer": {
      "name": "Drukarka 3D",
      "description": "<b>Autorska drukarka 3D</b><br>Projekt prywatny<br><br><b>Opis:</b><br>Drukarka 3D w pełni zaprojektowana i zbudowana przeze mnie od podstaw. Inspiracją były dostępne w sieci projekty, jednak żaden z nich nie spełniał moich wymagań dotyczących jakości wydruku, stabilności konstrukcji i optymalizacji rozmiaru urządzenia. Celem było uzyskanie dużego pola roboczego przy jednoczesnym minimalnym gabarycie drukarki oraz wyeliminowanie błędów konstrukcyjnych zauważonych w innych projektach.<br><br>Rama została zaprojektowana tak, aby zapewnić maksymalną sztywność i precyzję wydruku. Szczegółowy projekt wraz z wymiarami wykonałem w programie <b>Blender</b>. Następnie zamówiłem odpowiednie części, złożyłem urządzenie zgodnie z projektem i dostosowałem darmowe oprogramowanie <b>Repetier</b> do użytych komponentów. Elektronika została oparta o moduły Arduino dedykowane drukarkom 3D. Drukarka oferuje pole robocze o wymiarach ok. <b>20 × 20 × 40 cm</b> oraz podgrzewaną platformę wydruku.<br><br><b>Funkcje kluczowe:</b><br>- Własnoręcznie zaprojektowana i zoptymalizowana konstrukcja<br>- Duże pole robocze przy kompaktowych wymiarach urządzenia<br>- Stabilna rama zapewniająca wysoką jakość wydruków<br>- Elektronika oparta o komponenty Arduino<br>- Dostosowane oprogramowanie Repetier<br>- Podgrzewana podstawa wydruku<br><br><b>Moja rola:</b><br>- Pełna realizacja projektu – od koncepcji, przez projekt w Blenderze, po montaż i konfigurację urządzenia"
    },
    "spaceTaxi": {
      "name": "Space Taxi",
      "description": "<b>Gra zręcznościowa z mechaniką ścigania własnych cieni</b><br>Projekt prywatny<br><br><b>Opis:</b><br>Gra stworzona w ramach game jamu Ludum Dare 47, w ciągu 48 godzin. Gracz wciela się w kosmitę, którego celem jest jak najszybsze dotarcie do taksówki. Po każdej udanej rundzie gra się resetuje – ale tym razem gracz musi konkurować ze swoim cieniem, który dokładnie powtarza jego wcześniejsze ruchy. W każdej kolejnej rundzie pojawia się nowy cień, co sprawia, że gra staje się coraz trudniejsza i bardziej dynamiczna.<br><br>Aby zwiększyć swoje szanse, gracz może rozmieszczać przeszkody na trasie, blokując drogę swoim wcześniejszym wcieleniom i tym samym zyskując przewagę.<br><br><b>Funkcje kluczowe:</b><br>- Unikalna mechanika cieni odwzorowujących ruchy gracza z poprzednich rund<br>- Stopniowe zwiększanie poziomu trudności poprzez dodawanie kolejnych cieni<br>- Możliwość strategicznego rozmieszczania przeszkód<br>- Dynamiczna rozgrywka i rosnące tempo<br>- Styl graficzny dopasowany do estetyki jamowej gry indie<br><br><b>Moja rola:</b><br>- Pełna odpowiedzialność za projekt – od pomysłu, przez implementację, po publikację gry",
      "gameButton": "Gra",
      "gameJamButton": "Strona Game Jamu",
      "gitHubButton": "GitHub"
    },
    "guessPhrase": {
      "name": "Odgadnij hasło",
      "description": "<b>Gra w odgadywanie hasła</b><br>Projekt prywatny<br><br><b>Opis:</b><br>Prosta gra logiczna stworzona w ramach zaliczenia przedmiotu na studiach. Zadaniem gracza jest odgadnięcie hasła na podstawie podanej kategorii oraz liczby pustych pól odpowiadających literom. Gracz wybiera litery z alfabetu, mając do dyspozycji ograniczoną liczbę prób. Za poprawne odgadnięcie hasła otrzymuje punkty, natomiast błędna odpowiedź kończy rozgrywkę.<br><br>Gra umożliwia wprowadzenie swojego nicku i zapisanie wyniku na liście rankingowej. Dane o graczach i wynikach przechowywane są w bazie danych.<br><br><b>Funkcje kluczowe:</b><br>- Losowanie haseł z podziałem na kategorie<br>- Ograniczona liczba prób odgadywania liter<br>- System punktacji za poprawne hasła<br>- Ranking graczy z zapisanymi wynikami w bazie danych<br>- Możliwość wpisania nicku i dodania go do tabeli wyników<br><br><b>Moja rola:</b><br>- Pełna realizacja projektu – od koncepcji po implementację i uruchomienie"
    },
    "inventory": {
      "name": "Inwentaryzacja",
      "description": "<b>Mobilna aplikacja do inwentaryzacji</b><br>Projekt studencki – zespół 14 osób<br><br><b>Opis:</b><br>Aplikacja mobilna stworzona w ramach projektu zespołowego na studiach, mająca na celu wsparcie procesu inwentaryzacji środków trwałych w budynkach uczelni. Pozwala na skanowanie kodów QR przy użyciu aparatu smartfona, automatyczne zliczanie przeskanowanych przedmiotów, generowanie raportów oraz przeglądanie ich historii. Obsługa aplikacji została zaprojektowana tak, aby była prosta i intuicyjna, z myślą o pracownikach przeprowadzających inwentaryzacje.<br><br><b>Funkcje kluczowe:</b><br>- Logowanie do aplikacji przez e-mail i hasło<br>- Wybór budynku oraz sali przed rozpoczęciem inwentaryzacji<br>- Skanowanie kodów QR i automatyczne liczenie przeskanowanych przedmiotów<br>- Podgląd listy zeskanowanych i brakujących obiektów<br>- Możliwość oznaczenia brakujących przedmiotów jako znalezione<br>- Dodawanie nowych budynków i sal<br>- Generowanie raportów i ich podgląd w aplikacji<br><br><b>Moja rola:</b><br>- Stworzenie ekranu logowania<br>- Implementacja logiki skanowania kodów QR<br>- Opracowanie klas stylów dla spójnego wyglądu aplikacji<br>- Wdrożenie drobnych funkcjonalności w innych częściach aplikacji",
      "gitHubButton": "GitHub"
    },
    "lamp": {
      "name": "Lampa aRGB",
      "description": "<b>Lampa z adresowalnymi diodami LED RGB</b><br>Projekt prywatny<br><br><b>Opis:</b><br>Lampa stworzona w oparciu o Arduino Nano, wykorzystująca adresowalne diody LED RGB do generowania różnorodnych efektów świetlnych. Obudowa wykonana z rury PCV została uzupełniona o zaprojektowane przeze mnie zatyczki, wydrukowane na drukarce 3D, które utrzymują rdzeń z diodami LED w idealnym położeniu centralnym. Z tyłu lampy umieszczono gniazdo zasilania, a z przodu trzy przyciski umożliwiające zmianę trybu, regulację prędkości animacji oraz jasności świecenia.<br><br>Dodatkowo zaprojektowano specjalną zatyczkę z otworem na przewód USB, pozwalającą na szybkie podłączenie lampy do komputera i łatwe wgrywanie nowego oprogramowania. Lampa obsługuje m.in. tryby: symulacja ognia, deszcz, burza, tęczowe spirale oraz statyczne kolory.<br><br><b>Funkcje kluczowe:</b><br>- Wiele trybów efektów świetlnych (ogień, deszcz, burza, tęczowe spirale, kolory statyczne)<br>- Sterowanie trybem, prędkością i jasnością za pomocą przycisków<br>- Obudowa z rury PCV i własnoręcznie zaprojektowanych zatyczek 3D<br>- Możliwość łatwego podłączenia do komputera w celu aktualizacji oprogramowania<br><br><b>Moja rola:</b><br>- Pełna realizacja projektu – od koncepcji po implementację"
    },
    "craneSimulator": {
      "name": "Symulator Dźwigu",
      "description": "<b>Gra zręcznościowa dla dwóch osób z dedykowanym kontrolerem</b><br>Projekt prywatny – zespół 4 osób<br><br><b>Opis:</b><br>Gra stworzona w trakcie trzydniowego game jamu. Dwóch graczy wciela się w operatorów dźwigów i rywalizuje ze sobą, naprawiając zniszczony budynek. Celem jest zdobycie jak największej liczby punktów poprzez podnoszenie elementów z ciężarówki i umieszczanie ich w odpowiednich miejscach – m.in. naprawa okien, zamurowywanie dziur czy usuwanie graffiti. Każdy element jest losowany, co dodaje dynamiki rozgrywce.<br><br>Unikalnym aspektem projektu było stworzenie dedykowanego fizycznego kontrolera opartego na Arduino, który składał się z dwóch drążków oraz dwóch przycisków.<br><br><b>Funkcje kluczowe:</b><br>- Rywalizacja dwóch graczy w lokalnym trybie multiplayer<br>- Fizyczna interakcja z grą poprzez dedykowany kontroler<br>- Losowe generowanie elementów do naprawy<br>- System punktacji i zwycięstwa zależny od efektywności gracza<br>- Interaktywne zadania: podnoszenie, przenoszenie i umieszczanie obiektów<br><br><b>Moja rola:</b><br>- Współtworzenie koncepcji i zasad rozgrywki<br>- Zaprojektowanie i wykonanie fizycznego kontrolera Arduino<br>- Implementacja kontrolera i jego integracja z mechaniką gry",
      "gameButton": "Gra"
    }
  }
}
