{
  "header": {
    "title": "Portfolio – Radosław Nagiel"
  },
  "projects": {
    "now": "aktualnie",
    "targeto": {
      "name": "Targeto",
      "description": "<b>Aplikacja Mobilna do wyznaczania i realizacji celów</b><br>Prace nad nią trwają, nie jest jeszcze dostępna publicznie<br>Projekt autorski: pomysł, projekt UX/UI, implementacja<br><br><b>Opis:</b><br>Targeto to moja autorska aplikacja mobilna stworzona z myślą o osobach, które chcą skutecznie planować, realizować i monitorować swoje cele oraz rozwijać dobre nawyki. Zaprojektowana z naciskiem na minimalizm, przejrzystość i codzienną użyteczność. Aplikacja wspiera użytkownika na każdym etapie realizacji celów – od planowania, przez codzienne działania, aż po regularne podsumowania.<br><br><b>Funkcje kluczowe:</b><br>- <b>Tworzenie i zarządzanie celami</b> – podział na kategorie (np. nauka, praca, sport) oraz możliwość definiowania własnych obszarów.<br>- <b>Codzienne śledzenie aktywności</b> – użytkownik odznacza wykonane zadania, a aplikacja na bieżąco prezentuje postępy w formie procentowego wypełnienia celu.<br>- <b>Powiadomienia</b> – automatyczne przypomnienia dotyczące celów, aktywności i podsumowań.<br>- <b>Statystyki i analizy postępów</b> – prezentacja danych w prosty i motywujący sposób (zaplanowane cele, procent realizacji, aktywność dzienna).<br>- <b>Personalizacja</b> – możliwość wyboru jasnego lub ciemnego motywu, oraz dostosowanie powiadomień.<br>- <b>Kopia zapasowa</b> – możliwość lokalnego zapisania, oraz wczytania kopii zapasowej danych.<br><br><b>Moja rola:</b><br>Pełna odpowiedzialność za cały proces tworzenia aplikacji – od pomysłu, przez projektowanie, implementację i testowanie."
    },
    "quiz": {
      "name": "Quiz",
      "description": "<b>Aplikacja webowa, quiz jednokrotnego wyboru</b><br>Zrealizowane jako zadanie rekrutacyjne dla firmy <i>MAE Multimedia Art & Education</i><br><br><b>Opis:</b><br>Aplikacja webowa typu quiz jednokrotnego wyboru, stworzona w ramach zadania rekrutacyjnego. Projekt został zaprojektowany zgodnie ze specyfikacją techniczną, z naciskiem na funkcjonalność. Głównym celem było stworzenie pełnego i płynnego quizu.<br><br><b>Funkcje kluczowe:</b><br>- <b>Ekran startowy</b> z możliwość rozpoczęcia quizu i zmiany języka (PL/EN).<br>- <b>Pytania quizowe</b> z kilkoma odpowiedziami jednokrotnego wyboru oraz przyciskiem przejścia dalej.<br>- <b>Ekran podsumowania</b> z liczbą poprawnych i błędnych odpowiedzi oraz dynamicznym komunikatem zależnym od wyniku (0–50%, 51–80%, 81–100%).<br>- <b>Podgląd odpowiedzi</b> po zakończeniu quizu – prezentacja udzielonych i poprawnych odpowiedzi dla każdego pytania.<br>- <b>Dwujęzyczność</b> – wszystkie treści pobierane z zewnętrznych plików .json, możliwość zmiany języka w dowolnym momencie bez przerywania quizu.<br>- <b>Automatyczny restart</b> – po 5 minutach bezczynności aplikacja automatycznie wraca do ekranu startowego.<br><br><b>Moja rola:</b><br>Pełna realizacja zadania – implementacja frontendowa w Angularze zgodnie z wymaganiami technicznymi, przemyślany podział komponentów, obsługa logiki quizu, tłumaczeń, automatycznego resetu oraz dynamicznej prezentacji wyników.",
      "gitHubButton": "GitHub",
      "quizButton": "Demo quizu"
    },
    "wineryV2": {
      "name": "Winery V2",
      "description": "<b>Mobilny asystent domowego winiarza</b><br>Jest to odświeżona i ulepszona wersja mojej pracy inżynierskiej<br>Projekt autorski: pomysł, projekt UX/UI, implementacja, publikacja<br><br><b>Opis:</b><br>Winery to moja autorska aplikacja mobilna, stworzona z myślą o pasjonatach domowego winiarstwa. Aplikacja pełni rolę osobistego asystenta w całym procesie produkcji wina – od planowania i przeliczania składników, po zapisywanie własnych win i śledzenie postępów.<br><br><b>Funkcje kluczowe:</b><br>- <b>Przepisy i poradniki</b> – baza sprawdzonych przepisów oraz praktycznych wskazówek dla początkujących i zaawansowanych.<br>- <b>Kalkulatory winiarskie</b> – niezbędne podczas wytwarzania wina, automatyczne obliczanie na podstawie pomiarów.<br>- <b>Krok po kroku</b> – aplikacja prowadzi użytkownika przez cały proces produkcji, pokazując kolejne etapy i przypominając o działaniach.<br>- <b>Śledzenie postępu</b> – możliwość zaznaczania wykonanych kroków i obserwowania, na jakim etapie produkcji znajduje się dane wino.<br>- <b>Zarządzanie winiarnią</b> – zapisywanie win w trakcie produkcji oraz gotowych butelek z możliwością edycji i dodawania notatek.<br>- <b>Własne przepisy</b> – możliwość tworzenia i zapisywania własnych receptur, które można wykorzystać w przyszłości.<br>- <b>Zdjęcia win</b> – możliwość dodania zdjęcia, aby z łatwością rozróżnić wina w przyszłości.<br>- <b>Personalizacja</b> – możliwość wyboru jasnego lub ciemnego motywu.<br>- <b>Kopia zapasowa</b> – możliwość lokalnego zapisania, oraz wczytania kopii zapasowej danych.<br><br><b>Moja rola:</b><br>Pełna odpowiedzialność za cały proces: od pomysłu i projektowania, przez implementację, po testowanie i publikację.",
      "gitHubButton": "GitHub",
      "shopButton": "Android sklep"
    }
  }
}
